tap "anomalyco/tap"
tap "codecrafters-io/tap"
tap "gcenx/wine"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sikarugir-app/sikarugir", "https://github.com/Sikarugir-App/homebrew-sikarugir.git"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# C/C++/ObjC language server
brew "ccls"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Utilities for .cue and .toc files
brew "cuetools"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# I/O benchmark and stress test
brew "fio"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# JSON output from a shell
brew "jo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# LLM inference in C/C++
brew "llama.cpp"
# Access large language models from the command-line
brew "llm"
# Find what models run on your hardware
brew "llmfit"
# Language Server for the Lua language
brew "lua-language-server"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Array framework for Apple silicon
brew "mlx"
# Run LLMs with MLX
brew "mlx-lm"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform library for audio I/O
brew "portaudio"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# RC file (dotfile) management
brew "rcm"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Multi-purpose tool for manipulating and analyzing WAV files
brew "shntool"
# Opinionated Lua code formatter
brew "stylua"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Simple TTY terminal I/O application
brew "tio"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Open links in any browser
cask "choosy"
# Anthropic's official Claude AI desktop app
cask "claude"
# C and C++ IDE
cask "clion"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-aporetic"
cask "font-iosevka"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Hex editor for reverse engineers
cask "imhex"
# Keyboard customiser
cask "karabiner-elements"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Menu bar app for running local LLMs
cask "llama-app"
# VPN client
cask "mullvad-vpn"
# Open-source music notation software
cask "musescore"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Extreme time stretching plugin for audio files
cask "paulxstretch"
# Companion app for Flipper Zero devices
cask "qflipper"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Digital audio production application
cask "reaper"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Customise mouse buttons, wheels and cursor speed
cask "steermouse"
# Open-source BitTorrent client
cask "transmission"
# Easy to use text extraction tool
cask "trex"
# Multitrack guitar tablature editor and player
cask "tuxguitar"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Are.na for Safari", id: 1497800947
mas "Capo", id: 696977615
mas "DeathStranding", id: 6449748961
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "JSON Peep", id: 1458969831
mas "Keynote", id: 409183694
mas "Numbers", id: 361304891
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Parcel Classic", id: 639968404
mas "PrettyJSON for Safari", id: 1445328303
mas "Reeder", id: 1529448980
mas "Tampermonkey Classic", id: 1482490089
mas "TEFViewAS", id: 542912513
mas "Telegram", id: 747648890
mas "TextSniper", id: 1528890965
mas "Tomito", id: 1526042938
mas "uBlock Origin Lite", id: 6745342698
mas "Vimari", id: 1480933944
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
uv "huggingface-hub"
uv "python-lsp-server"
uv "ruff"
npm "@anthropic-ai/claude-code"
npm "corepack"
npm "pi-sandbox"
