tap "caarlos0/tap"
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "domt4/autoupdate"
tap "ethereum/ethereum"
tap "fsouza/prettierd"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "noborus/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "render-oss/render"
tap "thoughtbot/formulae"
brew "act"
brew "actionlint"
brew "awscli"
brew "bat"
brew "colima"
brew "coreutils"
brew "cuetools"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "dos2unix"
brew "duti"
brew "harfbuzz"
brew "openjdk"
brew "exa"
brew "exercism"
brew "fd"
brew "libass"
brew "pango"
brew "ffmpeg"
brew "findutils"
brew "fio"
brew "folly"
brew "fzf"
brew "fzy"
brew "gh"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "helm"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "leiningen"
brew "librsvg"
brew "lua-language-server"
brew "mas"
brew "mdcat"
brew "minikube"
brew "minimal-racket"
brew "mitmproxy"
brew "ncdu"
brew "neovim"
brew "pinentry-mac"
brew "prettyping"
brew "python@3.10"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "shellcheck"
brew "shntool"
brew "skaffold"
brew "solidity"
brew "stylua"
brew "switchaudio-osx"
brew "terminal-notifier"
brew "terraformer"
brew "tldr"
brew "unar"
brew "volta"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yt-dlp", link: false
brew "zbar"
brew "zls"
brew "zsh"
brew "caarlos0/tap/fork-cleaner"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"
brew "jakehilborn/jakehilborn/displayplacer"
brew "noborus/tap/ov"
brew "qmk/qmk/qmk", link: false
brew "render-oss/render/render"
brew "thoughtbot/formulae/rcm"
cask "1password-cli"
cask "adoptopenjdk"
cask "alacritty"
cask "audacity"
cask "balenaetcher"
cask "blackhole-2ch"
cask "brave-browser"
cask "calibre"
cask "dash"
cask "discord"
cask "disk-inventory-x"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iina"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "keycastr"
cask "logseq"
cask "michaelvillar-timer"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "monitorcontrol"
cask "mullvadvpn"
cask "musescore"
cask "neovide"
cask "now"
cask "obs"
cask "obsidian"
cask "openscad"
cask "patchwork"
cask "phoenix"
cask "qflipper"
cask "qmk-toolbox"
cask "quicklook-json"
cask "rectangle"
cask "slack"
cask "supercollider"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "vimr"
cask "visual-studio-code"
cask "wineskin"
cask "zoom"
cask "zotero"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Are.na for Safari", id: 1497800947
mas "Capo", id: 696977615
mas "Developer", id: 640199958
mas "Endel", id: 1484348796
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "NordVPN IKE", id: 1116599239
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Outline", id: 1356178125
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Pine Player", id: 1112075769
mas "Reeder", id: 1529448980
mas "Telegram", id: 747648890
mas "TextSniper", id: 1528890965
mas "Vimari", id: 1480933944
mas "Vinegar", id: 1591303229
mas "VOX", id: 461369673
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "Atishay-Jain.All-Autocomplete"
vscode "bierner.emojisense"
vscode "Ciantic.keymapceditor-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "JuanBlanco.solidity"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "Orta.vscode-jest"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "will-wow.vscode-alternate-file"
vscode "william-voyek.vscode-nginx"
