tap "caarlos0/tap"
tap "d12frosted/emacs-plus"
tap "derailed/k9s"
tap "domt4/autoupdate"
tap "ethereum/ethereum"
tap "fsouza/prettierd"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "noborus/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "render-oss/render"
tap "thoughtbot/formulae"
brew "act"
brew "awscli"
brew "bat"
brew "cloc"
brew "coreutils"
brew "cuetools"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "dos2unix"
brew "duti"
brew "exa"
brew "exercism"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "ffmpeg"
brew "findutils"
brew "fio"
brew "fzf"
brew "fzy"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "helm"
brew "httpie"
brew "jq"
brew "lua-language-server"
brew "mas"
brew "mdcat"
brew "minikube"
brew "minimal-racket"
brew "mkcert"
brew "ncdu"
brew "neovim"
brew "pinentry-mac"
brew "prettyping"
brew "python@3.10"
brew "rcm"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "shntool"
brew "skaffold"
brew "switchaudio-osx"
brew "terraform"
brew "tio"
brew "tldr"
brew "unar"
brew "volta"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "qmk/qmk/qmk", link: false
cask "1password-cli"
cask "audacity"
cask "balenaetcher"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "calibre"
cask "dash"
cask "discord"
cask "font-fira-code"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "gstreamer-runtime"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "keycastr"
cask "mullvadvpn"
cask "musescore"
cask "neovide"
cask "obs"
cask "obsidian"
cask "qflipper"
cask "qmk-toolbox"
cask "quicklook-json"
cask "rar"
cask "rectangle"
cask "slack"
cask "steermouse"
cask "supercollider"
cask "tor-browser"
cask "transmission"
cask "tunnelblick"
cask "vimr"
cask "visual-studio-code"
cask "wineskin"
cask "zoom"
cask "zotero"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Are.na for Safari", id: 1497800947
mas "Capo", id: 696977615
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Outline", id: 1356178125
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Reeder", id: 1529448980
mas "Telegram", id: 747648890
mas "TextSniper", id: 1528890965
mas "Vinegar", id: 1591303229
